{
    "language": "English",
    "welcome": "Welcome to my blog!",
    "changeLanguage": "Change Language",
    "logout": "Logout",
    "home": "Home",
    "blog": "Blog",
    "about": "About Me",
    "english": "English",
    "traditionalChinese": "繁體中文",
    "en-US": "English",
    "zh-TW": "繁體中文",
    "menu": "Menu",
    "theme": "Theme",
    "toggle": "Toggle",
    "toggleSomething": "Toggle {something}",
    "name": "Kevin",
    "homeProfession": "Professional Frontend Engineer",
    "homeDescription": "Dedicated to building modern and useful web applications.",
    "menuDescription": "Access navigation and settings",
    "aboutPage": {
        "name": "Kevin Luo",
        "basicInfo": "Basic Information",
        "education": {
            "title": "Education",
            "ntnu": "National Taiwan Normal University (2014.9~2018.6)",
            "iii": "Institute for Information Industry - Front-end Engineering Program (2022.03~2022.08)"
        },
        "basicInfoProjects": {
            "title": "Projects",
            "experience": "Project Experience",
            "budget": "Budget Management System",
            "eeSystem": "EE Engineer Parts Selection System",
            "factory": "Factory Scheduling System",
            "inventory": "Asset Inventory App",
            "coffee": "Coffee E-commerce Website",
            "overwatch": "OverWatch Website Layout Practice",
            "asus": "ASUS Website Layout Practice"
        },
        "experience": {
            "title": "Experience",
            "university": {
                "time": "September 2014",
                "title": "University Period",
                "content": "During 4 years of university, I joined the tennis club and served as a teaching director for 2 years, guiding over 15 beginners from zero to winning the inter-school championship.\nIn the meteorology group, I collaborated with classmates to produce 24 daily temperature and rainfall forecasts weekly for half a year, achieving accuracy comparable to the weather bureau."
            },
            "military": {
                "time": "January 2019",
                "title": "Military Service",
                "content": "Enlisted as a volunteer soldier and joined the honor guard for over 2 years. Mainly responsible for recording and organizing training and physical conditions of over 100 personnel in the company.\nAssisted in logistics support for annual Double Ten Day and New Year's Day events, and venue preparation for state leader visits at the Presidential Office."
            },
            "career": {
                "time": "September 2021",
                "title": "Career Transition",
                "content": "Started learning programming with C, mastering basics like variable declaration, loops, and pointers.\nUsed Python for LeetCode practice, and upon discovering frontend development, I found great interest in the 'what you see is what you code' paradigm, which led to my decision to become a frontend engineer."
            },
            "training": {
                "time": "March 2022",
                "title": "III Training Program",
                "content": "Participated in the Institute for Information Industry's Frontend Engineering Program. Collaborated with an 8-person team to develop a coffee shop e-commerce website using React, Node, and MySQL.\nSelf-learned Vue options/composition API during spare time."
            },
            "wiwynn": {
                "time": "October 2022",
                "title": "Wiwynn Corporation",
                "content": "Worked as a Frontend Engineer at Wiwynn Corporation, responsible for developing and refactoring multiple key projects.\nSuccessfully implemented TypeScript and Redux-Toolkit in legacy projects and upgraded Webpack, significantly improving team development efficiency and code quality.\nRefactored the budget management system using AG-Grid and Socket.IO, implementing data visualization and real-time collaborative editing with Chart.js.\nDeveloped multiple React and React Native applications, including factory scheduling system, automated purchasing system, and supplier mold inventory app, gaining experience in web, mobile, and desktop application development."
            }
        },
        "skills": {
            "title": "Skills",
            "htmlCssJs": {
                "title": "HTML/CSS/JavaScript",
                "items": [
                    "Proficient in ES6 syntax",
                    "Capable of implementing RWD responsive web pages with HTML, CSS, JavaScript"
                ]
            },
            "vue": {
                "title": "Vue.js",
                "items": [
                    "Proficient in both Options API and Composition API",
                    "Experienced with Pinia for state management"
                ]
            },
            "react": {
                "title": "React",
                "items": [
                    "Experience in team collaboration developing e-commerce and internal management systems using Function Hooks",
                    "Proficient in state management with Redux or Zustand",
                    "React Native development experience"
                ]
            },
            "git": {
                "title": "Git/Github",
                "items": [
                    "Version control with Git",
                    "Team collaboration using Github",
                    "Understanding of Git flow"
                ]
            },
            "backend": {
                "title": "Backend",
                "items": [
                    "Capable of creating and normalizing databases with MariaDB and PostgreSQL",
                    "Experience in developing APIs with Node.js and Express for frontend-backend integration"
                ]
            },
            "uiLibs": {
                "title": "UI Libraries",
                "items": [
                    "Familiar with MUI component library",
                    "Capable of customizing MUI styles with styled-components or emotion",
                    "Proficient in rapid styling with Tailwind CSS"
                ]
            }
        },
        "contactDetails": "Contact Details",
        "projects": {
            "title": "Projects",
            "items": {
                "asus": {
                    "title": "ASUS Website Practice",
                    "content": "Built database and backend system using Vue, PHP, and MySQL."
                },
                "scrollAnimation": {
                    "title": "Scroll Animation",
                    "content": "Implemented scroll-triggered animations, referencing AOS data sets approach and practicing Proxy pattern."
                },
                "asusLayout": {
                    "title": "ASUS Website Layout",
                    "content": "Practiced layout techniques like Flexbox using HTML and CSS."
                },
                "coffee": {
                    "title": "0+b Coffee E-commerce",
                    "content": "Collaborated in an 8-person team to develop an e-commerce site with React, responsible for shopping cart and shared components, created Express APIs for backend integration."
                },
                "resume": {
                    "title": "Personal Resume (Old Version)",
                    "content": "Created a personal resume website using React and SCSS."
                },
                "overwatch": {
                    "title": "Overwatch Website Layout",
                    "content": "Created a responsive and interactive webpage using HTML, CSS, and JavaScript."
                },
                "holoDashboard": {
                    "title": "Holo Dashboard",
                    "content": "Developed with Nextjs and Tailwind, using Express with Cheerio to scrape Youtube and Hololive website data, storing images on AWS S3."
                }
            }
        }
    }
}